Revit 2027 API
AreaBasedLoadData.PowerFactor Property
 The power factor of the area based load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double PowerFactor { get; }
Public ReadOnly Property PowerFactor As Double
	Get
public:
property double PowerFactor {
	double get ();
}
member PowerFactor : float with get
Property Value
Double
See Also
Reference
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace